AlmAck/svdtonuttx/demo/h/da1470_oqspif.h
/****************************************************************************
 * ./tmp/da1470_oqspif.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470_OQSPIF_H
#define __DA1470_OQSPIF_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470_OQSPIF_OQSPIF_BURSTBRK_OFFSET       0x0034 /* Read break sequence in Auto mode */
#define DA1470_OQSPIF_OQSPIF_BURSTCMDA_OFFSET      0x000C /* The way of reading in Auto mode (command register A) */
#define DA1470_OQSPIF_OQSPIF_BURSTCMDB_OFFSET      0x0010 /* The way of reading in Auto mode (command register B) */
#define DA1470_OQSPIF_OQSPIF_CHCKERASE_OFFSET      0x003C /* Check erase progress in Auto mode */
#define DA1470_OQSPIF_OQSPIF_CTRLBUS_OFFSET        0x0000 /* SPI Bus control register for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_CTRLMODE_OFFSET       0x0004 /* Mode Control register */
#define DA1470_OQSPIF_OQSPIF_CTR_CTRL_OFFSET       0x0100 /* Control register for the decryption engine of the OSPIC */
#define DA1470_OQSPIF_OQSPIF_CTR_EADDR_OFFSET      0x0108 /* End address of the encrypted content in the OSPI flash */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_0_3_OFFSET    0x0114 /* Key bytes 0 to 3 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_12_15_OFFSET  0x0120 /* Key bytes 12 to 15 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_16_19_OFFSET  0x0124 /* Key bytes 16 to 19 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_20_23_OFFSET  0x0128 /* Key bytes 20 to 23 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_24_27_OFFSET  0x012C /* Key bytes 24 to 27 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_28_31_OFFSET  0x0130 /* Key bytes 28 to 31 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_4_7_OFFSET    0x0118 /* Key bytes 4 to 7 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_8_11_OFFSET   0x011C /* Key bytes 8 to 11 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_NONCE_0_3_OFFSET  0x010C /* Nonce bytes 0 to 3 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_NONCE_4_7_OFFSET  0x0110 /* Nonce bytes 4 to 7 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_SADDR_OFFSET      0x0104 /* Start address of the encrypted content in the OSPI flash */
#define DA1470_OQSPIF_OQSPIF_DUMMYDATA_OFFSET      0x0020 /* Send dummy clocks to SPI Bus for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_ERASECMDA_OFFSET      0x0028 /* The way of erasing in Auto mode (command register A) */
#define DA1470_OQSPIF_OQSPIF_ERASECMDB_OFFSET      0x002C /* The way of erasing in Auto mode (command register B) */
#define DA1470_OQSPIF_OQSPIF_ERASECMDC_OFFSET      0x0030 /* The way of erasing in Auto mode (command register C) */
#define DA1470_OQSPIF_OQSPIF_ERASECTRL_OFFSET      0x0024 /* OSPI Erase control register */
#define DA1470_OQSPIF_OQSPIF_GP_OFFSET             0x0040 /* OSPI General Purpose control register */
#define DA1470_OQSPIF_OQSPIF_READDATA_OFFSET       0x001C /* Read data from SPI Bus for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_RECVDATA_OFFSET       0x0008 /* Received data for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_STATUSCMD_OFFSET      0x0038 /* The way of reading the status of external device in Auto mode */
#define DA1470_OQSPIF_OQSPIF_STATUS_OFFSET         0x0014 /* The status register of the OSPI controller */
#define DA1470_OQSPIF_OQSPIF_WRITEDATA_OFFSET      0x0018 /* Write data to SPI Bus for the Manual mode */

/* Register addresses *******************************************************/

#define DA1470_OQSPIF_BASE                         0x36000000 /* OQSPIF registers */

#define DA1470_OQSPIF_OQSPIF_BURSTBRK              (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_BURSTBRK_OFFSET) /* Read break sequence in Auto mode */
#define DA1470_OQSPIF_OQSPIF_BURSTCMDA             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_BURSTCMDA_OFFSET) /* The way of reading in Auto mode (command register A) */
#define DA1470_OQSPIF_OQSPIF_BURSTCMDB             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_BURSTCMDB_OFFSET) /* The way of reading in Auto mode (command register B) */
#define DA1470_OQSPIF_OQSPIF_CHCKERASE             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CHCKERASE_OFFSET) /* Check erase progress in Auto mode */
#define DA1470_OQSPIF_OQSPIF_CTRLBUS               (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTRLBUS_OFFSET) /* SPI Bus control register for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_CTRLMODE              (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTRLMODE_OFFSET) /* Mode Control register */
#define DA1470_OQSPIF_OQSPIF_CTR_CTRL              (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_CTRL_OFFSET) /* Control register for the decryption engine of the OSPIC */
#define DA1470_OQSPIF_OQSPIF_CTR_EADDR             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_EADDR_OFFSET) /* End address of the encrypted content in the OSPI flash */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_0_3           (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_0_3_OFFSET) /* Key bytes 0 to 3 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_12_15         (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_12_15_OFFSET) /* Key bytes 12 to 15 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_16_19         (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_16_19_OFFSET) /* Key bytes 16 to 19 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_20_23         (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_20_23_OFFSET) /* Key bytes 20 to 23 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_24_27         (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_24_27_OFFSET) /* Key bytes 24 to 27 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_28_31         (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_28_31_OFFSET) /* Key bytes 28 to 31 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_4_7           (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_4_7_OFFSET) /* Key bytes 4 to 7 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_KEY_8_11          (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_KEY_8_11_OFFSET) /* Key bytes 8 to 11 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_NONCE_0_3         (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_NONCE_0_3_OFFSET) /* Nonce bytes 0 to 3 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_NONCE_4_7         (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_NONCE_4_7_OFFSET) /* Nonce bytes 4 to 7 for the AES-CTR algorithm */
#define DA1470_OQSPIF_OQSPIF_CTR_SADDR             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_CTR_SADDR_OFFSET) /* Start address of the encrypted content in the OSPI flash */
#define DA1470_OQSPIF_OQSPIF_DUMMYDATA             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_DUMMYDATA_OFFSET) /* Send dummy clocks to SPI Bus for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_ERASECMDA             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_ERASECMDA_OFFSET) /* The way of erasing in Auto mode (command register A) */
#define DA1470_OQSPIF_OQSPIF_ERASECMDB             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_ERASECMDB_OFFSET) /* The way of erasing in Auto mode (command register B) */
#define DA1470_OQSPIF_OQSPIF_ERASECMDC             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_ERASECMDC_OFFSET) /* The way of erasing in Auto mode (command register C) */
#define DA1470_OQSPIF_OQSPIF_ERASECTRL             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_ERASECTRL_OFFSET) /* OSPI Erase control register */
#define DA1470_OQSPIF_OQSPIF_GP                    (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_GP_OFFSET) /* OSPI General Purpose control register */
#define DA1470_OQSPIF_OQSPIF_READDATA              (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_READDATA_OFFSET) /* Read data from SPI Bus for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_RECVDATA              (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_RECVDATA_OFFSET) /* Received data for the Manual mode */
#define DA1470_OQSPIF_OQSPIF_STATUSCMD             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_STATUSCMD_OFFSET) /* The way of reading the status of external device in Auto mode */
#define DA1470_OQSPIF_OQSPIF_STATUS                (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_STATUS_OFFSET) /* The status register of the OSPI controller */
#define DA1470_OQSPIF_OQSPIF_WRITEDATA             (DA1470_OQSPIF_BASE + DA1470_OQSPIF_OQSPIF_WRITEDATA_OFFSET) /* Write data to SPI Bus for the Manual mode */

/* Register bit definitions *************************************************/


/* OQSPIF_BURSTBRK Register */

#define OQSPIF_OSPIC_BRK_EN                        (1U << 23) /* Controls the application of a special command (read burst break sequence) that i */
#define OQSPIF_OSPIC_SEC_HF_DS                     (1U << 22) /* Disable output during the transmission of the second half (OSPIC_BRK_WRD[3:0]).  */
#define OQSPIF_OSPIC_BRK_TX_MD_MASK                (0x3 << 20) /* The mode of the OSPI Bus during the transmission of the burst break sequence. 0x */
#define OQSPIF_OSPIC_BRK_TX_MD_POS                 (20) /* The mode of the OSPI Bus during the transmission of the burst break sequence. 0x */
#define OQSPIF_OSPIC_BRK_SZ_MASK                   (0xF << 16) /* The size of Burst Break Sequence 0: One byte (Send OSPIC_BRK_WRD[15:8]) 1: Two b */
#define OQSPIF_OSPIC_BRK_SZ_POS                    (16) /* The size of Burst Break Sequence 0: One byte (Send OSPIC_BRK_WRD[15:8]) 1: Two b */
#define OQSPIF_OSPIC_BRK_WRD_MASK                  (0xFFFF << 0) /* This is the value of a special command (read burst break sequence) that is appli */
#define OQSPIF_OSPIC_BRK_WRD_POS                   (0) /* This is the value of a special command (read burst break sequence) that is appli */

/* OQSPIF_BURSTCMDA Register */

#define OQSPIF_OSPIC_DMY_TX_MD_MASK                (0x3 << 30) /* It describes the mode of the SPI bus during the Dummy bytes phase. 0x0: Single S */
#define OQSPIF_OSPIC_DMY_TX_MD_POS                 (30) /* It describes the mode of the SPI bus during the Dummy bytes phase. 0x0: Single S */
#define OQSPIF_OSPIC_EXT_TX_MD_MASK                (0x3 << 28) /* It describes the mode of the SPI bus during the Extra Byte phase. 0x0: Single SP */
#define OQSPIF_OSPIC_EXT_TX_MD_POS                 (28) /* It describes the mode of the SPI bus during the Extra Byte phase. 0x0: Single SP */
#define OQSPIF_OSPIC_ADR_TX_MD_MASK                (0x3 << 26) /* It describes the mode of the SPI bus during the address phase. 0x0: Single SPI 0 */
#define OQSPIF_OSPIC_ADR_TX_MD_POS                 (26) /* It describes the mode of the SPI bus during the address phase. 0x0: Single SPI 0 */
#define OQSPIF_OSPIC_INST_TX_MD_MASK               (0x3 << 24) /* It describes the mode of the SPI bus during the instruction phase. 0x0: Single S */
#define OQSPIF_OSPIC_INST_TX_MD_POS                (24) /* It describes the mode of the SPI bus during the instruction phase. 0x0: Single S */
#define OQSPIF_OSPIC_EXT_BYTE_MASK                 (0xFF << 16) /* The value of an extra byte which will be transferred after address (only if OSPI */
#define OQSPIF_OSPIC_EXT_BYTE_POS                  (16) /* The value of an extra byte which will be transferred after address (only if OSPI */
#define OQSPIF_OSPIC_INST_WB_MASK                  (0xFF << 8) /* Instruction Value for Wrapping Burst. This value is the selected instruction whe */
#define OQSPIF_OSPIC_INST_WB_POS                   (8) /* Instruction Value for Wrapping Burst. This value is the selected instruction whe */
#define OQSPIF_OSPIC_INST_MASK                     (0xFF << 0) /* Instruction Value for Incremental Burst or Single read access. This value is the */
#define OQSPIF_OSPIC_INST_POS                      (0) /* Instruction Value for Incremental Burst or Single read access. This value is the */

