AlmAck/svdtonuttx/demo/h/da1470_oqspif.h
/* OQSPIF_ERASECTRL Register */

#define OQSPIF_OSPIC_ERS_RES_DIS                   (1U << 28) /* This configuration bit has meaning when an erase has been suspended. Normally th */
#define OQSPIF_OSPIC_ERS_STATE_MASK                (0x7 << 25) /* It shows the progress of sector/block erasing (read only). 0x0: No Erase. 0x1: P */
#define OQSPIF_OSPIC_ERS_STATE_POS                 (25) /* It shows the progress of sector/block erasing (read only). 0x0: No Erase. 0x1: P */
#define OQSPIF_OSPIC_ERASE_EN                      (1U << 24) /* During Manual mode (OSPIC_AUTO_MD = 0). This bit is in read only mode. During Au */
#define OQSPIF_OSPIC_ERS_ADDR_MASK                 (0xFFFFF << 4) /* Defines the address of the block/sector that is requested to be erased. If OSPIC */
#define OQSPIF_OSPIC_ERS_ADDR_POS                  (4) /* Defines the address of the block/sector that is requested to be erased. If OSPIC */

/* OQSPIF_GP Register */

#define OQSPIF_OSPIC_PADS_SLEW_MASK                (0x3 << 3) /* QSPI pads slew rate control. Indicative values under certain conditions: 0: Rise */
#define OQSPIF_OSPIC_PADS_SLEW_POS                 (3) /* QSPI pads slew rate control. Indicative values under certain conditions: 0: Rise */
#define OQSPIF_OSPIC_PADS_DRV_MASK                 (0x3 << 1) /* QSPI pads drive current 0: 4 mA 1: 8 mA 2: 12 mA 3: 16 mA */
#define OQSPIF_OSPIC_PADS_DRV_POS                  (1) /* QSPI pads drive current 0: 4 mA 1: 8 mA 2: 12 mA 3: 16 mA */

/* OQSPIF_READDATA Register */

#define OQSPIF_OSPIC_READDATA_MASK                 (0xFFFFFFFF << 0) /* A read access at this register generates a data transfer from the external memor */
#define OQSPIF_OSPIC_READDATA_POS                  (0) /* A read access at this register generates a data transfer from the external memor */

/* OQSPIF_RECVDATA Register */

#define OQSPIF_OSPIC_RECVDATA_MASK                 (0xFFFFFFFF << 0) /* This register contains the received data when the OSPIC_READDATA_REG register is */
#define OQSPIF_OSPIC_RECVDATA_POS                  (0) /* This register contains the received data when the OSPIC_READDATA_REG register is */

/* OQSPIF_STATUSCMD Register */

#define OQSPIF_OSPIC_RSTAT_DMY_ZERO                (1U << 30) /* Defines the value of that is transferred on the OSPI bus during the phase of the */
#define OQSPIF_OSPIC_RSTAT_DMY_TX_MD_MASK          (0x3 << 28) /* It describes the mode of the OSPI bus during the dummy bytes phase. 0x0: Single  */
#define OQSPIF_OSPIC_RSTAT_DMY_TX_MD_POS           (28) /* It describes the mode of the OSPI bus during the dummy bytes phase. 0x0: Single  */
#define OQSPIF_OSPIC_RSTAT_DMY_NUM_MASK            (0xF << 24) /* Number of dummy bytes (minus 1). Can be set 1 up to 16 dummy bytes (values 0 up  */
#define OQSPIF_OSPIC_RSTAT_DMY_NUM_POS             (24) /* Number of dummy bytes (minus 1). Can be set 1 up to 16 dummy bytes (values 0 up  */
#define OQSPIF_OSPIC_RSTAT_DMY_EN                  (1U << 23) /* Enables the transmission of dummy bytes, immediately after the instruction code  */
#define OQSPIF_OSPIC_STSDLY_SEL                    (1U << 22) /* Defines the timer which is used to count the delay that it has to wait before to */
#define OQSPIF_OSPIC_RESSTS_DLY_MASK               (0x3F << 16) /* Defines a timer that counts the minimum required delay between the reading of th */
#define OQSPIF_OSPIC_RESSTS_DLY_POS                (16) /* Defines a timer that counts the minimum required delay between the reading of th */
#define OQSPIF_OSPIC_BUSY_VAL                      (1U << 15) /* Defines the value of the Busy bit which means that the flash is busy. 0: The fla */
#define OQSPIF_OSPIC_BUSY_POS_MASK                 (0x7 << 12) /* It describes who from the bits of status represents the Busy bit (7 - 0). */
#define OQSPIF_OSPIC_BUSY_POS_POS                  (12) /* It describes who from the bits of status represents the Busy bit (7 - 0). */
#define OQSPIF_OSPIC_RSTAT_RX_MD_MASK              (0x3 << 10) /* The mode of the OSPI Bus during the receive status phase of the read status inst */
#define OQSPIF_OSPIC_RSTAT_RX_MD_POS               (10) /* The mode of the OSPI Bus during the receive status phase of the read status inst */
#define OQSPIF_OSPIC_RSTAT_TX_MD_MASK              (0x3 << 8) /* The mode of the OSPI Bus during the instruction phase of the read status instruc */
#define OQSPIF_OSPIC_RSTAT_TX_MD_POS               (8) /* The mode of the OSPI Bus during the instruction phase of the read status instruc */
#define OQSPIF_OSPIC_RSTAT_INST_MASK               (0xFF << 0) /* The code value of the read status instruction. It is transmitted during the inst */
#define OQSPIF_OSPIC_RSTAT_INST_POS                (0) /* The code value of the read status instruction. It is transmitted during the inst */

/* OQSPIF_STATUS Register */

#define OQSPIF_OSPIC_BUSY                          (1U << 0) /* The status of the SPI Bus.  0: The SPI Bus is idle 1: The SPI Bus is active. Rea */

/* OQSPIF_WRITEDATA Register */

#define OQSPIF_OSPIC_WRITEDATA_MASK                (0xFFFFFFFF << 0) /* Writing to this register is generating a data transfer from the controller to th */
#define OQSPIF_OSPIC_WRITEDATA_POS                 (0) /* Writing to this register is generating a data transfer from the controller to th */

#endif /* __DA1470_OQSPIF_H */
